[
  "RT DavidBLowry: \\@PetrovADmitri \\@OdedRechavi The development of GENESPACE by \\@_johntlovell et al. for comparative genomics, at both the macroevolutionary and microevolutionary level, seems like a timely advance, just as pangenomes are becoming available for many different species. https://elifesciences.org/articles/78526",
  "RT AlexisMychajliw: Thankful to be quoted in this article that draws attention to opportunities for community-based fossil & conservation research in urban ecosystems, one of the many exciting \\@CnsrvPaleoNetwk working groups! (incl. \\@Middlebury students!) https://www.nytimes.com/2022/12/17/science/la-river-fossils-paleobiology.html",
  "RT ElliotHershberg: My final essay for 2022 🧬\n\nThe genomics revolution is now enabling a broad exploration across the Tree of Life.\n\nLet's explore the wild world of Extreme Biology:",
  "RT biorxivpreprint: Root-associated Fungi in Orchidaceae: Diversity, Phylogeny, Ecology, and Outstanding Questions  https://biorxiv.org/cgi/content/short/2022.12.16.519622v1 #bioRxiv",
  "RT fungidb: \\@veupathdb \\@Iamherox Let’s get some more votes! Retweet and tag others please \\@BarleyPathology \\@hyphaltip \\@talbotlabTSL \\@KamounLab \\@AmeliaBarberPhD \\@wenboEffector \\@cramer_lab \\@BallouLab Vote for #VEuPathDB https://www.herox.com/dataworks/round/2457/entry/41364",
  "RT granogan: Started the first full day of #SICB2023 with a fantastic (and visually stunning) talk. \\@chipotlau discusses her work with \\@UCSB_OakleyLab on testing functions inferred from orthologs using in vitro characterization of Ostracod luciferases 💡💡💡",
  "RT AnzaBResearch: A desert lily (hesperocallis undulata) which just started flowering here deep into the Borrego Badlands. Many still in early flowering stages (Photo: Sicco Rood).",
  "RT HokeCSU: Spend the summer working on this collaborative project with us, Mark Bee, and \\@jessiectanner. REU opportunities in both Colorado and Minnesota.\n\nQT Amir_Neuro: Our lab is recruiting for 2 REU students this summer for independent projects on the neural basis of acoustic communication and mate choice in Hyla Chrysoscelis. Please help spread the word! \\@HokeCSU",
  "RT palaeokatie: 330 million year old perfection - a wee crinoid ossicle that beautifully highlights their five-fold (pentaradial) symmetry. There’s also a tiny fragment of bryozoan in the bottom right 🖤",
  "RT ShellyGaynor: Since our shiny app is impossible to make google index properly, I made our Biology PhD Stipend shiny app github public:\n\nhttps://github.com/mgaynor1/BiologyPhDStipends",
  "RT kareem_carr: so i guess we’re doing this now",
  "Definitely a manuscript I'll be following the comments on! Looks interesting. https://analytics.twitter.com/mob_idsync_click?slug=IHnjOUW2CI&idb=AAAAEIDV56--C5cEXrCrIxG3eUFGUuY1yB6RyoXul3eL6bpv_U5T_u39UFwV8c6luUVGX-QaHuBqcwEF09t7wtFxGzPZRlSapUmIWCnRWnomR2Cr2OaeuLsoW6YTc6seSlpIQZYygV4qGm3BZHfkYqBN4AuVEM-iGBza_4si_8WCaEsbz6cf--QIFbDA5TxRg9RnzVuyg1bfQOlkeszl_xRzH0NzsgaHseDVtRZWnm2oeYYBfuKg_hCmNUmMptcbAK8UWXlM3hTNvzHJlaw2q6tnyg&tailored_ads=false&ad_tracking=false",
  "RT protistologists: Halteria: These Freshwater Microorganisms Can Grow on Virus-Only Diet https://www.sci.news/biology/halteria-11555.html #protists \n\nThe consumption of #viruses returns energy to food chains https://www.pnas.org/doi/10.1073/pnas.2215000120",
  "RT kasson_wvu: I can’t recall a single fungus 🍄 with a darker “underbelly” than this Hypoxylon fragiforme culture 🧫 we have currently growing in the lab! It’s like staring 👁️ into a fungus black hole🍄⚫️🤯! #ButInCulture",
  "RT AG__McCoy: I obtained some Rhynie Chert (400 mya) thin section slides and was pretty amazed at the fungal fossils within! You can see some thick walled individual spores within one of the vesicles #fungalfossils",
  "RT strandbergbio: Today in ingenious historical experiments: Theodor Engelmann demonstrated that chloroplasts are the site of oxygen production in plants by taking bacteria that would migrate towards oxygen and seeing that they went to the choloroplast\n\n(from Howard Berg's \"E coli in Motion\")",
  "RT Aerin_J: JOB: Curator, Professor, and Chief Conservation Scientist \\@AMNH \n\n* What a great position! \n* Full time, permanent\n* Salary range $140k-185k/yr\n* Open until filled \n* Details: https://careers.amnh.org/postings/3488\n\n#ConservationJobs",
  "RT zlatogursky: For a lecture made one more version of #eTOL. Feel free to use if you like it. Drop me a message if you want svg-file",
  "RT maziyarj: Our work on self-assembly of chloroplasts in plant cells is finally out \\@PNASNews 🎉 \nWe show how these “particles” exhibit active glassy behaviour.\n\nRead more about it here:\nhttps://www.pnas.org/doi/10.1073/pnas.2216497120\n\nand \\@nicoschramma thread below!\n#glassy #plants\n\nQT nicoschramma: Yay! First paper of my PhD is out in \\@PNASNews! \nWe studied the motion of chloroplasts and found intriguing dynamics which resemble… https://twitter.com/twitter/status/1615454213638586368",
  "RT hyphaltip: Genomic resources enable insight into the developmental transcriptome of the blastoclad fungus, Coelomomyces lativittatus, an obligate parasite of mosquitoes and microcrustaceans https://www.biorxiv.org/content/10.1101/2023.01.14.524055v1",
  "RT G_Pask: Happening today! Excited for the community see the hard work of my Entomology class and \\@AlexisMychajliw‘s Mammalogy class!\n\nProject-based learning for the win!\n\nQT G_Pask: CALLING ALL POKÉ-FANS!\n\nWhat do your favorite Pokémon have in common with the local mammals and insects you know and love?\n\nThe \\@Middlebury Biology Mammalogy and Entomology students would love to host you on Saturday Dec 10th for a Poké Pop-Up Museum!",
  "RT PLOSBiology: #Antarctic terrestrial #biodiversity is at risk; \\@JaszzyJas \\@Iadinec &co show that existing #conservation efforts are insufficient, and that simultaneous global & regional efforts are urgently needed to save #Antarctica for future generations #PLOSBiology https://plos.io/3WkTS6j",
  "RT waDNR: It is reckless and illegal to give your true love any amount of wild birds for Christmas.",
  "RT IUCN_SMSG: Rodents can be a hard sell, but we think they're amazing! They play key roles in different ecosystems worldwide, and are a gloriously diverse bunch. Despite this, they are often overlooked in research, conservation and funding. Find our thoughts here: https://theconversation.com/in-defence-of-rodents-why-healthy-ecosystems-need-them-196406",
  "RT AlexisMychajliw: So excited to see this manuscript out & thankful to have the opportunity to work with so many amazing people, including \\@Middlebury undergraduate Elizabeth Austin!\n\nQT erinmdillon: 📢Our publication \"What is conservation paleobiology? Tracking 20 years of research and development\" is now out in \\@FrontEcolEvol! The OA article is available at: https://www.frontiersin.org/articles/10.3389/fevo.2022.1031483/full\n\n#conservation #paleobiology #geohistorical",
  "RT DeLongLab1: OK I am stoked about our new paper showing ciliates can grow on a diet of just viruses. Check it out here (article: https://www.pnas.org/doi/10.1073/pnas.2215000120) or read about it here (story: https://www.eurekalert.org/news-releases/975344).",
  "RT hyphaltip: new paper is out in \\@GenomeBiolEvol from \\@zygolife project, 140\nGenomes from the #kickxellomycotina (Zoopagomycota) fungi — Mycoparasites, gut dwellers, and saprotrophs: Phylogenomic reconstructions and comparative analyses of Kickxellomycotina fungi https://academic.oup.com/gbe/advance-article/doi/10.1093/gbe/evac185/6974727",
  "RT ScienceyRosalie: My first preprint! The huge protein complex eIF2B senses cell stress via its conformation. How is conformational change coordinated across its 10 subunits? We discover that a central helix acts as a  fulcrum to allosterically control ISR stress sensing. https://www.biorxiv.org/content/10.1101/2022.12.22.521453v1.article-metrics",
  "RT microscopicture: tardigrade enjoying some volvox algae",
  "RT MuseumGuyScott: #MontanaStateUniversity Earth Science Dept looking for a new Asst. Professor of Paleontology! More info at the link!! https://jobs.montana.edu/postings/33545",
  "RT CStrulluDerrien: Exceptionally well-preserved cyanobacteria from the 407 million-year-old Rhynie chert.",
  "RT FossilBonanza: The most common arthropod in the Burgess Shale is Marrella with over 25,000 specimens. Despite its superficial appearance, it was NOT a trilobite rather a distant relative.\n#BurgessShaleWeek #paleontology\nhttps://www.nature.com/articles/429040a",
  "RT efisg_escmid: Very helpful! A ‘must-read’ for all mycologists:  https://academic.oup.com/ofid/article/10/1/ofac559/6974385",
  "RT AnzaBResearch: Snow on the mountains all around Borrego Springs, while there is an abundance of flowers in the valley below (Photo: Sicco Rood). \\@NWSSanDiego",
  "RT edward_the6: I spent New Years building GPTZero — an app that can quickly and efficiently detect whether an essay is ChatGPT or human written",
  "RT daily__hedgehog: Tuesday 3rd January, 2023",
  "RT goleylab: Thinking about attending the #BacterialCellBiology GRC? Apply now to make sure you get your spot. Topics include: motility, cell organization/structure, cellular decision-making, structure/transport of genetic material, interspecies interactions, morphogenesis/division, and more!\n\nQT goleylab: Y'ALL. The time has come. Registration is NOW OPEN for the 2023 Bacterial Cell Biology and Development \\@GordonConf. I'm thinking we're… https://twitter.com/twitter/status/1613618001193861122",
  "RT nightsciencepod: Check out Sarah Teichmann on the Night Science Podcast, where she talks about storytelling vs. modeling when interpreting data, and hard vs. soft hypotheses when pursuing a problem.\nhttps://podcasts.apple.com/us/podcast/sarah-teichmanns-artist-colony-of-scientists/id1563415749?i=1000522016870",
  "RT madsjw: OK fluids people, WTF is with that hexagon?\n\nQT redditSpacePorn: This is one of the closest photo of Saturn ever taken.",
  "RT dr_alphalyrae: USPS just dropped forever stamps for 2023 and one of the themes is microscopic images 🦠",
  "RT protistologists: A comparative ultrastructural study on the nanoscale #extrusomes of #tintinnids (Alveolata, Ciliophora, Spirotricha) and their phylogenetic significance https://www.sciencedirect.com/science/article/pii/S0932473922000906 #protists #ciliates by \\@FB_EnvBiodiv",
  "Always a treat to read about venom evo!\n\nQT YehuMoran: 1/3 When it rains, it pours (in a good way!). I'm proud of this paper \\@NatureComms: great collaboration led by \\@joachimsurm in my lab and \\@ed_omics in \\@adam_reitzel's lab about how venom genes evolve in sea anemones, both between and within species https://www.nature.com/articles/s41467-023-35794-9 🧵",
  "Incredible. This works on so many levels for the modern day. http://www.slate.com/blogs/atlas_obscura/2014/07/02/barcelona_supercomputing_center_at_the_former_chapel_torre_girona.html",
  "RT nanopore: Now on stage, our first speaker NCM 2022, \\@khmiga (KM) with her talk: Expanding studies of global genomic diversity with complete, telomere-to-telomere assembly of diploid genomes. #nanoporeconf",
  "RT IUCN_SMSG: The next #SmallMammalSpotlight is on Alston's Singing Mouse. Singing mice make long, trilling, audible vocalisations, which is unusual for mice! Listen to an example of their singing here: https://www.youtube.com/watch?v=Y4RIsY3-0XI"
]